[
  {
    "id": "1",
    "videoTitle": "TechTalk Comprehensive Review: Samsung Galaxy Z Fold 5 Complete Analysis and Performance Testing",
    "platform": "YouTube",
    "date": "2024-01-15",
    "analysis": "Samsung Galaxy Z Fold 5 delivers exceptional build quality with a 7.6-inch foldable AMOLED display offering 120Hz refresh rate. The triple camera system captures 50MP main photos with excellent 108MP ultrawide capabilities. Battery life reaches up to 8 hours of screen-on time with 25W fast charging. Performance is powered by Snapdragon 8 Gen 2 achieving 1,250,000 in AnTuTu benchmark. However, the $1,799 price point remains a significant barrier for many consumers."
  },
  {
    "id": "2",
    "videoTitle": "MobileMaster's TikTok Review: iPhone 15 Pro",
    "platform": "TikTok",
    "date": "2024-01-10",
    "analysis": "iPhone 15 Pro features a 6.1-inch Super Retina XDR display with 120Hz ProMotion technology and 2000 nits peak brightness. The Pro camera system includes 48MP main sensor with 5x optical zoom and 4K 120fps video recording. A17 Pro chip delivers 15% better CPU performance than previous generation. Battery life extends to 9 hours of video playback with 27W fast charging. The titanium build adds 20% weight reduction compared to stainless steel models."
  },
  {
    "id": "3",
    "videoTitle": "InstaTech's Review: Pixel 8 Pro",
    "platform": "Instagram",
    "date": "2024-01-05",
    "analysis": "Google Pixel 8 Pro boasts a 6.7-inch LTPO OLED display with 120Hz refresh rate and 1600 nits peak brightness. The 50MP main camera with computational photography excels in low light, achieving 89% better night photography scores. Tensor G3 chip provides 20% faster AI processing. Battery capacity reaches 5050mAh with 30W fast charging. 7 years of OS updates and 5 years of security patches make it future-proof."
  },
  {
    "id": "4",
    "videoTitle": "Ultimate Unboxing Experience: MacBook Pro M3 Max with Complete Setup Guide and First Impressions",
    "platform": "YouTube",
    "date": "2024-01-20",
    "analysis": "MacBook Pro 16-inch with M3 Max chip delivers 2.5x faster performance than M1 with 40GB unified memory. The 16.2-inch Liquid Retina XDR display offers 1600 nits peak brightness and P3 color gamut covering 100% of DCI-P3. Battery life extends to 22 hours of web surfing with 140W fast charging. Weighing 4.7 pounds, it includes three Thunderbolt 4 ports and HDMI 2.0. The $3,499 starting price reflects premium build quality and ecosystem integration."
  },
  {
    "id": "5",
    "videoTitle": "Quick Review: AirPods Pro 2",
    "platform": "TikTok",
    "date": "2024-01-18",
    "analysis": "AirPods Pro (2nd generation) feature H2 chip with 2x faster processing and improved active noise cancellation reducing ambient noise by up to 48dB. Battery life reaches 6 hours of listening time with 30 hours total when using charging case. Spatial audio with dynamic head tracking provides immersive 360-degree sound. Touch controls offer 50% faster response time. Sweat and water resistant with IPX4 rating, priced at $249."
  },
  {
    "id": "6",
    "videoTitle": "Sony WH-1000XM5 Honest and Detailed Review: Sound Quality, Noise Cancellation and Battery Life Test",
    "platform": "YouTube",
    "date": "2024-01-22",
    "analysis": "Sony WH-1000XM5 wireless headphones deliver industry-leading noise cancellation reducing noise by up to 99.7% with dual noise sensors. Battery life extends to 30 hours of continuous playback with 3-minute quick charge providing 3 hours. 30mm drivers produce frequency response from 4Hz to 40kHz. Bluetooth 5.2 with multipoint connection supports two devices simultaneously. Comfortable design with 4 sizes of ear tips, priced at $399."
  },
  {
    "id": "7",
    "videoTitle": "iPad Air M2 vs iPad Pro",
    "platform": "Instagram",
    "date": "2024-01-25",
    "analysis": "iPad Air (5th gen) with M2 chip offers 15% faster CPU performance than M1, achieving 1,800,000 in AnTuTu. 10.9-inch Liquid Retina display provides 500 nits brightness with P3 color accuracy. Battery life reaches 10 hours of web surfing with 20W USB-C charging. 12MP front camera supports Center Stage for video calls. At $599, it offers 80% of Pro features at 60% lower price point compared to $1,099 iPad Pro."
  },
  {
    "id": "8",
    "videoTitle": "Gaming on Steam Deck OLED",
    "platform": "YouTube",
    "date": "2024-01-28",
    "analysis": "Steam Deck OLED features 7.4-inch 1280x800 display with 90Hz refresh rate and 1000 nits peak brightness, 70% brighter than LCD model. AMD RDNA 3 GPU delivers 25% better performance in demanding games. Battery life extends to 7-8 hours in most titles with 45W fast charging. Storage options include 512GB NVMe SSD with read speeds up to 7000MB/s. Weighing 1.5 pounds with anti-glare screen coating, priced at $549."
  },
  {
    "id": "9",
    "videoTitle": "Samsung Galaxy S24 Ultra Professional Camera Test: Low Light Photography and 200MP Sensor Performance Analysis",
    "platform": "TikTok",
    "date": "2024-02-01",
    "analysis": "Samsung Galaxy S24 Ultra's 200MP main sensor captures 16-in-1 pixel binning for 12.5MP photos with improved 35% low-light performance. 50MP ultrawide and 10MP telephoto lenses provide 3x and 10x optical zoom. Video recording supports 8K at 30fps with AI stabilization. Battery capacity of 5000mAh lasts 11 hours of screen-on time. IP68 water resistance and S Pen stylus included, priced at $1,299."
  },
  {
    "id": "10",
    "videoTitle": "Nothing Phone 2 Long Term Review",
    "platform": "YouTube",
    "date": "2024-02-03",
    "analysis": "Nothing Phone 2 features 6.7-inch AMOLED display with 120Hz refresh rate and 1200 nits peak brightness. Snapdragon 8+ Gen 1 delivers 1,050,000 AnTuTu score with 16GB RAM. 50MP dual camera system captures 108MP ultrawide photos. Battery life reaches 8 hours of gaming with 45W fast charging. Glyph Interface provides 10 different notification patterns, priced at $599."
  },
  {
    "id": "11",
    "videoTitle": "Best Budget Laptop 2024: Complete Buying Guide with Top 10 Recommendations Under $500 for Students and Professionals",
    "platform": "Instagram",
    "date": "2024-02-05",
    "analysis": "Budget laptops under $500 typically feature AMD Ryzen 5 7520U processors delivering 25% better performance than Intel Celeron. 15.6-inch 1080p IPS displays offer 45% wider color gamut than TN panels. Battery life ranges from 6-8 hours with 45W chargers. 512GB SSD storage provides 10x faster boot times than HDD. Models like Acer Aspire 5 and Lenovo IdeaPad 3 offer best value at $399-$449 price points."
  },
  {
    "id": "12",
    "videoTitle": "Meta Quest 3 VR Experience",
    "platform": "YouTube",
    "date": "2024-02-08",
    "analysis": "Meta Quest 3 features 128GB storage with Snapdragon XR2 Gen 2 providing 2x faster performance than Quest 2. Dual 4K displays offer 2064x2208 resolution per eye with 120Hz refresh rate. Battery life extends to 2.5 hours with 45W fast charging. Inside-out tracking works in 20x20 foot spaces without external sensors. Priced at $499, it includes 200+ games and apps with 97% compatibility with Quest 2 library."
  },
  {
    "id": "13",
    "videoTitle": "DJI Mini 4 Pro Drone Review",
    "platform": "TikTok",
    "date": "2024-02-10",
    "analysis": "DJI Mini 4 Pro weighs 249 grams under 250g limit, enabling flight without FAA registration. 4K 60fps video with 1/1.3-inch CMOS sensor captures 48MP photos. Flight time reaches 34 minutes with 18km/h max speed. 4x digital zoom with 4K active track maintains subject in frame. Return-to-home feature works up to 10km range. Priced at $759 with remote ID compliance."
  },
  {
    "id": "14",
    "videoTitle": "LG C3 OLED TV In-Depth Review: Picture Quality, Gaming Features, HDR Performance and Smart TV Capabilities",
    "platform": "YouTube",
    "date": "2024-02-12",
    "analysis": "LG C3 65-inch OLED delivers perfect blacks with infinite contrast ratio and 120Hz refresh rate. HDMI 2.1 supports 4K 120fps gaming with 0.1ms response time. webOS 23 platform loads apps 30% faster than previous version. Dolby Vision IQ adjusts brightness automatically. Energy Star certified with 55 watts power consumption. Priced at $1,497 for 65-inch model."
  },
  {
    "id": "15",
    "videoTitle": "Apple Watch Ultra 2 Features",
    "platform": "Instagram",
    "date": "2024-02-14",
    "analysis": "Apple Watch Ultra 2 features 49mm titanium case with 100m water resistance and MIL-STD-810H durability. S9 SiP chip provides 20% faster performance with 36-hour battery life. Always-on Retina display offers 3000 nits peak brightness. Precision Finding with UWB locates items up to 120 feet away. ECG accuracy reaches 98.3% for atrial fibrillation detection. Priced at $799."
  },
  {
    "id": "16",
    "videoTitle": "Lenovo Legion Go Handheld Gaming",
    "platform": "YouTube",
    "date": "2024-02-16",
    "analysis": "Lenovo Legion Go features 8.8-inch 1600x2560 IPS display with 144Hz refresh rate and 500 nits brightness. AMD Ryzen Z1 Extreme delivers 15% better performance than Steam Deck. Battery life reaches 2.5 hours of gaming with 65W fast charging. Hall effect triggers provide 10 million click lifecycle. Weighing 2.49 pounds with vapor chamber cooling, priced at $699."
  },
  {
    "id": "17",
    "videoTitle": "OnePlus 12 Pro Detailed Camera Comparison: Side by Side with iPhone 15 Pro Max and Samsung Galaxy S24 Ultra",
    "platform": "TikTok",
    "date": "2024-02-18",
    "analysis": "OnePlus 12 Pro features 100W SUPERVOOC charging completing full charge in 29 minutes. 50MP triple camera system with Hasselblad tuning captures 64MP ultrawide photos. Snapdragon 8 Gen 3 achieves 1,650,000 AnTuTu score. 6.82-inch AMOLED display offers 4500 nits peak brightness. OxygenOS 14 provides 40% faster system performance, priced at $999."
  },
  {
    "id": "18",
    "videoTitle": "Framework Laptop 16 Review Framework Laptop 16 Review Framework Laptop 16 Review Framework Laptop 16 Review Framework Laptop 16 Review",
    "platform": "YouTube",
    "date": "2024-02-20",
    "analysis": "Framework Laptop 16 features 16-inch 2560x1600 display with 120Hz refresh rate and 100% DCI-P3 coverage. Intel Core i7-13700H delivers 25% better multi-threaded performance. Modular design allows 100% user-repairability with 30+ expansion cards. Battery life extends to 8 hours with 60W charging. Starting at $1,099 with 3-year warranty and lifetime support."
  },
  {
    "id": "19",
    "videoTitle": "Sony A7 IV Photography Test Sony A7 IV Photography Test Sony A7 IV Photography Test Sony A7 IV Photography Test Sony A7 IV Photography Test",
    "platform": "Instagram",
    "date": "2024-02-22",
    "analysis": "Sony A7 IV features 33MP full-frame BSI CMOS sensor with ISO range from 50 to 204,800. 759-point AF system covers 94% of frame with 93% accuracy. 4K video recording at 60fps with 6K oversampling. Battery life reaches 580 shots per charge with USB-C charging. Dual card slots support CFexpress Type A and SD. Priced at $2,499 body only."
  },
  {
    "id": "20",
    "videoTitle": "Asus ROG Ally Gaming Performance",
    "platform": "YouTube",
    "date": "2024-02-25",
    "analysis": "Asus ROG Ally features 7-inch 1920x1080 IPS display with 120Hz refresh rate and 500 nits brightness. AMD Ryzen Z1 Extreme provides 15% better performance than Steam Deck. Battery life reaches 1.5 hours of gaming with 65W fast charging. X-axis triggers offer 30g actuation force with 1.5mm travel. Windows 11 compatibility allows 100% PC game library access, priced at $599."
  }
]
